Autodesk.Revit.DB.Grid.GetExtents
Gets the extents of the grid in the model.
Returns:
The extents are the 3D bounding box surrounding the grid.  The Z coordinates of the box are used by
Revit to determine if the grid should be displayed in a corresponding view plan (if the grid is linear). The
extents are not used for arc grids.
Since:
2013

Autodesk.Revit.DB.Grid.SetVerticalExtents(System.Double,System.Double)
Adjusts the grid to extend through only the vertical range between bottom and top.
bottom:
The bottom range of the grid extents.  It must be a valid number and below the top range.
top:
The top range of the grid extents.  It must be a valid number and above the bottom range.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The bottom and top ranges are reversed for the extents.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for bottom must be no more than 30000 feet in absolute value.
-or-
The given value for top must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Couldn't change the extents of the grid.
Since:
2016

Autodesk.Revit.DB.Grid.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Arc)
Creates a new radial grid line.
Remarks:
The arc should be on a horizontal plane.
document:
The document in which the new instance is created.
arc:
An arc object that represents the location of the new grid line.
Returns:
The newly created grid line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input arc is not on horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Grid.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Line)
Creates a new grid line.
Remarks:
The line should be on a horizontal plane.
document:
The document in which the new instance is created.
line:
A line which represents the location of the grid line.
Returns:
The newly created grid line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input line is not on horizontal plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Grid.IsCurved
Identifies if the grid line is curved or straight.
Remarks:
A value of True is returned if the grid line is an arc or False if the grid line is
straight. Use the Curve property to retrieve an object that represents the geometry of the grid
line.

Autodesk.Revit.DB.Grid.Curve
Retrieves an object that represents the geometry of the grid line.
Remarks: The geometry can either be an arc or a curve. The IsCurved property can be used to determine
this.

Autodesk.Revit.DB.Grid
Represents a single grid line within Autodesk Revit.
Remarks:
A Grid is a DatumPlane, so it is actually a three dimensional surface. It can be either a plane parallel to
the project z-axis, or else a cylinder whose axis is parallel to the project z-xis. Autodesk::Revit::DatumPlane